{
  "abacum": {
    "q10_collaboration": {
      "question_justification": "Abacum permite colaboración avanzada en tiempo real, workflows de aprobación, comentarios y control de permisos por usuario.",
      "options": {
        "43": "La herramienta está pensada para colaboración, aunque puede usarse individualmente.",
        "44": "Sí, aunque ofrece funcionalidades más avanzadas.",
        "45": "Confirmado con workflows personalizados y aprobación.",
        "46": "Sí, completamente soportado."
      }
    },
    "q4_time": {
      "question_justification": "La implementación de Abacum suele completarse en semanas. No es una herramienta plug & play ni requiere despliegues de varios meses.",
      "options": {
        "13": "No aplica, no es solución self-service ni plug & play.",
        "14": "Coincide con lo mencionado como implementación “rápida”.",
        "15": "Aceptable si hay integraciones complejas.",
        "16": "Posible en ediciones enterprise, pero no es lo ideal."
      }
    },
    "q13_implementation": {
      "question_justification": "100% Cloud SaaS. No disponible On-Premise ni Híbrido.",
      "options": {
        "58": "Sí, es su única modalidad.",
        "59": "No disponible.",
        "60": "No disponible."
      }
    },
    "q3_pricing": {
      "question_justification": "Abacum ofrece precios personalizados en formato SaaS, con diferencias por tipo de usuario. No hay evidencia de precios por uso ni planes mensuales.",
      "options": {
        "10": "Abacum diferencia entre roles de usuario (Admin, Contributor), lo que sugiere cierto componente “por usuario”.",
        "11": "No hay referencias a facturación mensual; lo común es facturación anual.",
        "12": "No se documenta que escale en función de consumo o uso variable como los usage-based models."
      }
    },
    "q8_reporting": {
      "question_justification": "Abacum incluye: Dashboards personalizables, Drill-down sobre informes, Visualizaciones interactivas, Exportación directa a PowerPoint/PDF → no documentada",
      "options": {
        "35": "Confirmado que se pueden construir dashboards propios.",
        "36": "Drill-down explícitamente documentado.",
        "37": "Confirmado con visualizaciones navegables e interactivas.",
        "38": "No se menciona en ninguna fuente la exportación directa a estos formatos."
      }
    },
    "q12_scalability": {
      "question_justification": "Abacum está diseñado para manejar millones de filas y estructuras complejas. No se menciona integración con data lakes.",
      "options": {
        "54": "Soportado aunque sobredimensionado para volúmenes tan bajos.",
        "55": "Buena compatibilidad.",
        "56": "Sí, diseñado para manejar este rango.",
        "57": "Alta capacidad, aunque no se documenta integración con data lakes explícita."
      }
    },
    "q7_cases": {
      "question_justification": "Abacum cubre todos los casos de uso listados: budgeting, escenarios, workforce, ventas, caja y OpEx.",
      "options": {
        "28": "Es el caso de uso central y está muy desarrollado.",
        "29": "Confirmado, con dashboards interactivos y exportables.",
        "30": "Incluye escenario what-if, seguimiento de variaciones.",
        "31": "Soportado, aunque menos detallado en la ficha que budgeting puro.",
        "32": "Documentado como funcionalidad, aunque no se destaca tanto.",
        "33": "Es parte del modelo, aunque no tratado como módulo separado.",
        "34": "Incluido dentro del presupuesto operativo, aunque no aislado."
      }
    },
    "q11_ia": {
      "question_justification": "Abacum ofrece capacidades AI como forecast, detección de anomalías, escenarios y consulta por lenguaje natural, pero no cubre reporting narrativo ni variance analysis automatizado.",
      "options": {
        "47": "Sí, a través de Abacum Intelligence.",
        "48": "No está documentado.",
        "49": "Parcialmente soportado.",
        "50": "Sí, disponible en Abacum Intelligence.",
        "51": "No se documenta.",
        "52": "Sí, soportado.",
        "53": "No aplica a evaluación técnica."
      }
    },
    "q5_excel": {
      "question_justification": "Es una solución completamente en la nube e independiente de Excel, pero ofrece integración bidireccional con Excel y Google Sheets. No es un add-in ni depende de Excel para funcionar",
      "options": {
        "17": "No es un add-in ni se integra dentro de Excel.",
        "18": "Encaja exactamente con la forma de integración que ofrece Abacum.",
        "19": "Abacum está diseñada como reemplazo completo de Excel en FP&A.",
        "20": "Compatible con cualquier enfoque, pero no es una ventaja específica."
      }
    },
    "q1_size": {
      "question_justification": "Abacum está orientado a empresas medianas y scale-ups, típicamente entre 100 y 800 empleados.",
      "options": {
        "0": "Muy por debajo del público objetivo. Abacum no se enfoca en microempresas.",
        "1": "Aún pequeño, aunque podrían ser clientes en fase de expansión.",
        "2": "Dentro del segmento objetivo (scale-ups).",
        "3": "Núcleo del target. Referencias como Cabify, Ebury lo confirman.",
        "4": "Posible pero fuera del foco principal."
      }
    },
    "q2_budget": {
      "question_justification": "El coste medio estimado de Abacum ronda los $22.500 USD/año, con un rango de ~$8.600 a ~$63.000 USD/año.",
      "options": {
        "5": "Por debajo del umbral más bajo reportado ($8.600). Difícil de ajustar.",
        "6": "Dentro del rango óptimo (mediana ~$22.500).",
        "7": "Encaja con el rango superior estimado.",
        "8": "Aceptable para ediciones enterprise, pero menos común.",
        "9": "Rango alto para su público objetivo, aunque posible en casos complejos."
      }
    },
    "q9_modeling": {
      "question_justification": "Cuenta con modelado financiero avanzado y multidimensional. Aunque no se detalla automatización avanzada tipo enterprise, soporta estructuras complejas y múltiples dimensiones.",
      "options": {
        "39": "Abacum tiene modelado avanzado, no limitado a estructuras básicas.",
        "40": "Sí, soportado como base del modelo.",
        "41": "Confirmado, es una de las fortalezas principales.",
        "42": "Capacidad elevada, pero sin evidencia de automatización avanzada."
      }
    },
    "q6_integrations": {
      "question_justification": "Abacum ofrece integraciones con ERP, CRM, HRIS, data warehouses y Excel/Sheets. No hay evidencia de integración con herramientas BI ni de campo libre para sistemas personalizados.",
      "options": {
        "21": "Confirmada integración con NetSuite, QuickBooks, etc.",
        "22": "Confirmadas ambas integraciones nativas.",
        "23": "BambooHR aparece como sistema usado por cliente real (Dr. Smile).",
        "24": "No se menciona ninguna integración directa.",
        "25": "Confirmada compatibilidad y conectividad vía S3, API.",
        "26": "Bidireccional, import/export confirmado.",
        "27": "No evaluable, por defecto neutro (no info)."
      }
    }
  },
  "acterys": {
    "q10_collaboration": {
      "question_justification": "Acterys proporciona funcionalidades de colaboración intermedias con comentarios y seguimiento de cambios, aunque sus capacidades de workflows avanzados y aprobaciones son más limitadas.",
      "options": {
        "43": "Funciona individualmente, pero está diseñada para entornos colaborativos.",
        "44": "Posibilidad de compartir dashboards y hojas Excel.",
        "45": "Workflows por tareas, aprobación, revisión de cambios y control de permisos disponibles.",
        "46": "Colaboración total en tiempo real, con gestión granular de acceso y auditoría."
      }
    },
    "q4_time": {
      "question_justification": "Acterys permite una implementación relativamente rápida de 1-3 semanas gracias a su integración con Power BI y Excel, aunque requiere configuración inicial de conectores y modelos.",
      "options": {
        "13": "Requiere configuración de modelos e integraciones, no es self-service.",
        "14": "Posible en empresas con stack Microsoft maduro.",
        "15": "Implementación habitual, según documentación y casos reales.",
        "16": "Posible si se requiere desarrollo de visuales personalizados o consolidación compleja."
      }
    },
    "q13_implementation": {
      "question_justification": "Acterys ofrece principalmente implementación cloud/SaaS, con algunas opciones limitadas para escenarios híbridos gracias a su arquitectura basada en Power BI.",
      "options": {
        "58": "Es el modelo principal de Acterys, disponible como servicio cloud.",
        "59": "Disponible como opción en planes Enterprise.",
        "60": "Ofrece despliegue híbrido según la arquitectura del cliente."
      }
    },
    "q3_pricing": {
      "question_justification": "Acterys utiliza un modelo de suscripción anual basado en usuarios y módulos, con cierta flexibilidad en sus planes pero sin opciones de pago por uso o planes mensuales.",
      "options": {
        "10": "Modelos definidos por usuario; escalabilidad ajustada al número de licencias.",
        "11": "No hay evidencia de facturación mensual.",
        "12": "Se ajusta al volumen de usuarios, no directamente al uso variable."
      }
    },
    "q8_reporting": {
      "question_justification": "Acterys sobresale en reporting gracias a su integración nativa con Power BI, ofreciendo potentes capacidades de visualización, dashboards interactivos y análisis drill-down.",
      "options": {
        "35": "Confirmado mediante Power BI y visuales personalizados.",
        "36": "Drill-down soportado en visuales de Power BI.",
        "37": "Visuales como Gantt, Waterfall, segmentación interactiva soportados.",
        "38": "Posible desde Power BI; Acterys sincroniza contenido."
      }
    },
    "q12_scalability": {
      "question_justification": "Acterys maneja eficientemente volúmenes de datos medianos, con buen rendimiento hasta aproximadamente 1M de filas, pero puede presentar limitaciones con conjuntos de datos muy grandes o estructuras altamente complejas.",
      "options": {
        "54": "Acterys está sobreinfraestructurado para volúmenes bajos.",
        "55": "Muy buen rendimiento confirmado sobre Azure SQL.",
        "56": "Casos reales con múltiples entidades y millones de registros.",
        "57": "Soportado si se configura adecuadamente con modelos bien diseñados."
      }
    },
    "q7_cases": {
      "question_justification": "Acterys destaca en presupuestos, forecasting y análisis de varianzas, con capacidades moderadas para planificación de personal y ventas, y funcionalidades básicas para gestión de flujo de caja.",
      "options": {
        "28": "Caso de uso central soportado nativamente.",
        "29": "Dashboards interactivos y reportes financieros confirmados en Power BI.",
        "30": "Escenarios soportados; variance no automatizado por AI.",
        "31": "No hay módulo específico documentado; podría modelarse manualmente.",
        "32": "Soportado a través de drivers y modelos multidimensionales.",
        "33": "Modelable pero no destacado como módulo separado.",
        "34": "Soportado dentro del flujo de planificación."
      }
    },
    "q11_ia": {
      "question_justification": "Acterys ofrece capacidades de IA moderadas, aprovechando parcialmente las funcionalidades de Power BI para forecasting y análisis, pero con limitaciones en detección avanzada de anomalías y consultas en lenguaje natural.",
      "options": {
        "47": "Soportado mediante integración con Power BI y algoritmos Acterys.",
        "48": "No documentado como funcionalidad automatizada.",
        "49": "Soportado a través de cambios de drivers, no automatizado con IA.",
        "50": "No se menciona funcionalidad de detección de anomalías.",
        "51": "No se documenta módulo narrativo ni autosummary.",
        "52": "Parcialmente soportado vía Power BI Q&A.",
        "53": "No aplica a evaluación técnica."
      }
    },
    "q5_excel": {
      "question_justification": "Acterys ofrece una fuerte integración con Excel, permitiendo a los usuarios seguir trabajando en este entorno familiar mientras aprovechan las capacidades avanzadas de planificación y análisis.",
      "options": {
        "17": "SmartXL ofrece integración directa dentro de Excel.",
        "18": "Diseñada justo para ello: puede funcionar en Power BI o en SmartXL.",
        "19": "Acterys puede funcionar sin Excel, pero se beneficia del ecosistema Office.",
        "20": "Neutral, ya que es compatible con múltiples entornos."
      }
    },
    "q1_size": {
      "question_justification": "Acterys está orientado a empresas pequeñas y medianas, con capacidades que pueden adaptarse a organizaciones desde 10 hasta 500 empleados, siendo menos adecuado para corporaciones muy grandes.",
      "options": {
        "0": "Aunque Acterys es escalable, su diseño se orienta más a estructuras organizativas complejas.",
        "1": "Podría aplicarse, especialmente si ya trabajan con Power BI.",
        "2": "Encaja bien con clientes típicos como Thorne Widgery o MyHealth.",
        "3": "Es el foco ideal para Acterys, como muestra el caso de CMC Materials.",
        "4": "Admite gran volumen de datos, pero clientes Enterprise no son mayoría."
      }
    },
    "q2_budget": {
      "question_justification": "Acterys ofrece planes desde aproximadamente 12K USD/año, con opciones escalables según usuarios y funcionalidades, posicionándose como una alternativa más económica que competidores enterprise.",
      "options": {
        "5": "Disponible solo para planes mínimos; funcionalidad limitada.",
        "6": "Encaja con el rango estimado para planes Start y Professional.",
        "7": "Rango habitual en empresas medianas con múltiples usuarios.",
        "8": "Válido para configuraciones Enterprise con visuales y almacenamiento extendido.",
        "9": "Posible en casos con muchos usuarios, aunque no es el promedio."
      }
    },
    "q9_modeling": {
      "question_justification": "Acterys ofrece capacidades de modelado intermedias a avanzadas, permitiendo estructuras multidimensionales y dependencias lógicas, aunque con algunas limitaciones para casos enterprise muy complejos.",
      "options": {
        "39": "Tiene capacidades avanzadas, pero podría usarse de forma sencilla.",
        "40": "Modelado multidimensional confirmado, drivers y dependencias soportadas.",
        "41": "Estructuras complejas soportadas sobre SQL con múltiples dimensiones y fórmulas definidas.",
        "42": "Alta capacidad, pero sin mención a automatización tipo 'autoscaling' u optimización masiva de performance."
      }
    },
    "q6_integrations": {
      "question_justification": "Acterys proporciona integraciones con sistemas ERP, CRM y otras fuentes de datos a través de conectores predefinidos, con especial énfasis en su integración con Excel y Power BI.",
      "options": {
        "21": "Integraciones directas confirmadas con QuickBooks, Xero, Dynamics 365.",
        "22": "Integración nativa disponible para Salesforce y HubSpot.",
        "23": "No se documenta integración específica con HRIS, pero podría hacerse vía API o ETL.",
        "24": "Integración nativa y visuales certificados para Power BI; no se documenta Looker o Tableau.",
        "25": "Conectividad con SQL Server nativa; otros warehouses posibles vía conectores o ETL.",
        "26": "Integración directa con Excel mediante SmartXL; sin soporte directo para Google Sheets documentado.",
        "27": "Via API podrían integrarse otros sistemas, pero requiere desarrollo."
      }
    }
  },
  "anaplan": {
    "q10_collaboration": {
      "question_justification": "Anaplan ofrece capacidades de colaboración enterprise avanzadas con workflows complejos, aprobaciones multinivel, audit trail detallado y gestión granular de permisos para grandes equipos distribuidos globalmente.",
      "options": {
        "43": "Diseñado para múltiples usuarios y flujos integrados, innecesario para uso individual.",
        "44": "Soporta inputs y colaboración sencilla, aunque con aprendizaje inicial.",
        "45": "Permite colaboración por roles, vista y sección.",
        "46": "Workflows interconectados para budget owners, aprobaciones y revisión de versiones."
      }
    },
    "q4_time": {
      "question_justification": "Anaplan requiere una implementación prolongada de 2-6 meses para despliegues enterprise completos, con tiempo adicional para configuración de modelos complejos, integraciones y capacitación de usuarios.",
      "options": {
        "13": "Requiere modelado, arquitectura, carga de datos. No es plug-and-play.",
        "14": "Una prueba limitada podría activarse, pero no una solución funcional.",
        "15": "Plazo razonable para pilotos estructurados con soporte de partner.",
        "16": "Tiempo habitual en clientes con múltiples flujos, integraciones y diseño de modelos."
      }
    },
    "q13_implementation": {
      "question_justification": "Anaplan es principalmente una solución cloud/SaaS enterprise, aunque ofrece opciones para escenarios híbridos y consideraciones especiales para organizaciones con requisitos regulatorios o de seguridad específicos.",
      "options": {
        "58": "Anaplan es una plataforma cloud-native. 100% alojada en la nube.",
        "59": "No disponible en ningún caso. Solo SaaS.",
        "60": "No ofrece componentes híbridos instalables localmente."
      }
    },
    "q3_pricing": {
      "question_justification": "Anaplan utiliza un modelo de suscripción anual enterprise con precios personalizados basados en usuarios, volumen de datos y complejidad de modelos, sin opciones mensuales ni planes estándar publicados.",
      "options": {
        "10": "Modelo posible, pero combina pricing por capacidad, módulos y roles, no sólo por usuario.",
        "11": "No se ofrece este modelo. Solo contrato anual enterprise.",
        "12": "Al ser modular y con Workspaces escalables, puede adaptarse parcialmente al uso real."
      }
    },
    "q8_reporting": {
      "question_justification": "Anaplan ofrece potentes capacidades de reporting enterprise con dashboards personalizables, análisis multidimensional avanzado y opciones de visualización sofisticadas para comunicación financiera a todos los niveles.",
      "options": {
        "35": "Flexibilidad moderada, interfaz mejorada con la nueva UX de apps.",
        "36": "Sí. Navegación jerárquica muy precisa entre niveles y versiones.",
        "37": "Visualizaciones limitadas frente a herramientas de BI líderes.",
        "38": "Soportado desde UX con múltiples opciones de exportación."
      }
    },
    "q12_scalability": {
      "question_justification": "Anaplan sobresale en escalabilidad enterprise, manejando eficientemente enormes volúmenes de datos y modelos extremadamente complejos para corporaciones globales con múltiples unidades de negocio.",
      "options": {
        "54": "Funciona bien, aunque puede ser una solución sobredimensionada.",
        "55": "Ideal para operaciones de tamaño medio con necesidad de consolidación.",
        "56": "Escala sin problema para millones de celdas gracias a su motor Hyperblock.",
        "57": "Diseñado para empresas globales con estructuras multinivel y multientidad."
      }
    },
    "q7_cases": {
      "question_justification": "Anaplan sobresale en planificación enterprise compleja, consolidación financiera a gran escala, y modelado multidimensional avanzado, con capacidades superiores para todos los casos de uso FP&A en entornos corporativos.",
      "options": {
        "28": "Anaplan es líder en planificación financiera avanzada, multidimensional y driver-based.",
        "29": "Dispone de dashboards personalizables pero no es una herramienta BI especializada.",
        "30": "Capacidad potente para escenarios y análisis por versiones y dimensiones.",
        "31": "Requiere modelado específico, pero posible y documentado.",
        "32": "Soporta forecast de ventas y revenue desde fuentes como Salesforce.",
        "33": "Capacidad total para flujos operativos, CapEx, working capital y treasury models.",
        "34": "Altamente configurable para planes detallados de costes por centro, función o región."
      }
    },
    "q11_ia": {
      "question_justification": "Anaplan incorpora capacidades de IA avanzadas para forecasting, optimización, análisis predictivo y planificación de escenarios a escala enterprise, aunque con algunas limitaciones en consultas en lenguaje natural.",
      "options": {
        "47": "Se puede lograr conectando Anaplan con soluciones externas, pero no es nativo.",
        "48": "No cuenta con módulo específico automatizado para análisis de desviaciones.",
        "49": "Muy potente a nivel manual y con versiones paralelas, pero sin IA embebida.",
        "50": "No dispone de herramientas automáticas de detección de anomalías.",
        "51": "Los insights deben ser modelados manualmente, no se generan con IA nativa.",
        "52": "No tiene funcionalidades de lenguaje natural ni búsqueda inteligente.",
        "53": "Neutral si no se requieren capacidades de IA."
      }
    },
    "q5_excel": {
      "question_justification": "Anaplan es una plataforma independiente con su propia interfaz y modelado, aunque ofrece buena integración con Excel para importación y exportación de datos, no depende de hojas de cálculo para su funcionamiento.",
      "options": {
        "17": "Dispone de plugin que conecta Anaplan desde Excel.",
        "18": "Alta interoperabilidad con Excel vía conectores y exportaciones.",
        "19": "Sí. El core está diseñado para funcionar completamente en entorno propio sin hojas externas.",
        "20": "Excel puede integrarse o dejarse de lado, según necesidad."
      }
    },
    "q1_size": {
      "question_justification": "Anaplan está orientado principalmente a grandes empresas y corporaciones, siendo más adecuado para organizaciones de 500+ empleados con necesidades de planificación enterprise complejas y a gran escala.",
      "options": {
        "0": "Anaplan está pensado para grandes organizaciones. No es viable para microempresas.",
        "1": "El coste y la complejidad lo hacen poco recomendable para este tamaño.",
        "2": "Podría ser útil para empresas en fase de crecimiento estructurado, pero no es su core.",
        "3": "Empresas de este tamaño pueden comenzar a beneficiarse si tienen operaciones complejas.",
        "4": "Core target. Anaplan se orienta a estructuras multinacionales y planificación a gran escala."
      }
    },
    "q2_budget": {
      "question_justification": "Anaplan se posiciona en el segmento premium del mercado FP&A, con planes que típicamente superan los 75K USD/año para implementaciones enterprise, escalando significativamente según usuarios, módulos y complejidad.",
      "options": {
        "5": "Inviable para presupuestos reducidos. Mínimo coste suele estar por encima de los 100K USD.",
        "6": "Muy difícil adaptar el coste a este rango. Sólo casos excepcionales bajo fuerte descuento.",
        "7": "Posible entrada para licencias muy limitadas o pilotos sectoriales.",
        "8": "Viable para una implementación inicial controlada con usuarios clave.",
        "9": "Rango estándar para clientes Anaplan, especialmente a nivel enterprise."
      }
    },
    "q9_modeling": {
      "question_justification": "Anaplan proporciona capacidades de modelado enterprise-level superiores, soportando estructuras multidimensionales altamente complejas, numerosos drivers y modelado a gran escala para organizaciones globales.",
      "options": {
        "39": "Requiere configuración y estructura previa. No orientado a usuarios sin background técnico.",
        "40": "Viable con soporte inicial. Requiere cierta experiencia de modelado o consultoría externa.",
        "41": "Diseñado para modelado empresarial avanzado sobre múltiples dimensiones.",
        "42": "Orientado a compañías multinacionales con necesidades complejas de planificación."
      }
    },
    "q6_integrations": {
      "question_justification": "Anaplan proporciona integraciones enterprise robustas con sistemas ERP (SAP, Oracle), CRM, HRIS y data warehouses, con conectores avanzados y opciones de personalización para ecosistemas complejos.",
      "options": {
        "21": "Anaplan ofrece conectores con SAP, Oracle, Workday, entre otros.",
        "22": "Integra con Salesforce mediante conectores dedicados o API.",
        "23": "Integra con Workday y otros HRIS vía ETL/API, aunque no todos nativamente.",
        "24": "Se puede conectar con herramientas BI vía exportación y APIs.",
        "25": "Integrable vía API o herramientas ETL externas.",
        "26": "Alta compatibilidad mediante conectores, Add-ins y exportaciones.",
        "27": "Vía API abierta, puede integrarse con sistemas personalizados."
      }
    }
  },
  "cube": {
    "q10_collaboration": {
      "question_justification": "Cube ofrece capacidades de colaboración intermedias con comentarios, seguimiento de cambios y permisos básicos, pero carece de workflows avanzados de aprobación y colaboración en tiempo real.",
      "options": {
        "43": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "44": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "45": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "46": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas."
      }
    },
    "q4_time": {
      "question_justification": "Cube requiere una implementación moderada de 1-4 semanas, no es plug & play inmediato pero tampoco necesita despliegues prolongados de varios meses.",
      "options": {
        "13": "Aunque Cube tiene implementación rápida, no es plug & play inmediato. Requiere configuración de integraciones y modelos.",
        "14": "Cube puede ser implementado en pocas semanas si la estructura de datos está preparada, gracias a su enfoque sobre Excel.",
        "15": "Cube suele implementarse en pocas semanas, y 1-2 meses es un rango razonable dependiendo de las integraciones.",
        "16": "Cube no requiere despliegues largos; está pensado para implementación rápida. Más de 2 meses solo aplicaría en casos complejos."
      }
    },
    "q13_implementation": {
      "question_justification": "Cube es una solución exclusivamente cloud/SaaS, sin opciones on-premise o híbridas disponibles para organizaciones con requisitos de implementación local.",
      "options": {
        "58": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "59": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "60": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas."
      }
    },
    "q3_pricing": {
      "question_justification": "Cube utiliza un modelo de suscripción anual basado en usuarios y módulos, sin opciones mensuales ni por uso variable. No ofrece planes gratuitos ni freemium.",
      "options": {
        "10": "Cube tiene un modelo de licencias por usuario documentado, lo que implica que el coste total escala con el número de usuarios.",
        "11": "Cube no opera mediante planes mensuales estándar, sino suscripciones anuales negociadas por cliente.",
        "12": "No se menciona un modelo variable por uso; los costes se definen según número de usuarios e integraciones, no consumo activo."
      }
    },
    "q8_reporting": {
      "question_justification": "Cube ofrece capacidades de reporting moderadas a través de Excel/Sheets, con opciones básicas para dashboards y análisis visual, pero carece de exportaciones directas a PowerPoint/PDF.",
      "options": {
        "35": "Cube permite crear dashboards en Excel/Google Sheets usando datos conectados en tiempo real.",
        "36": "Cube no tiene funcionalidad de drill-down nativa, aunque puede simularse en hojas conectadas.",
        "37": "Compatibilidad con gráficos y visualizaciones de Excel y Google Sheets. Cube permite a los usuarios aprovechar las herramientas gráficas de las hojas de cálculo para crear gráficos personalizados con datos extraídos de Cube. No ofrece su propio motor de visualización de datos, pero permite exportar información a herramientas de BI para análisis más avanzados.",
        "38": "Cube no tiene opción directa para exportar informes; depende de funcionalidades de Excel o Sheets."
      }
    },
    "q12_scalability": {
      "question_justification": "Cube maneja eficientemente volúmenes de datos pequeños a medianos, pero puede presentar limitaciones con conjuntos de datos muy grandes (>1M filas) o estructuras enterprise de alta complejidad.",
      "options": {
        "54": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "55": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "56": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "57": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas."
      }
    },
    "q7_cases": {
      "question_justification": "Cube destaca en presupuestos y forecasting, con capacidades moderadas para reporting y análisis de varianzas, y funcionalidades básicas para planificación de personal, ventas, flujo de caja y gastos operativos.",
      "options": {
        "28": "Cube está diseñado específicamente para procesos de presupuestación, forecast y rolling forecast. Permite trabajar directamente sobre hojas de cálculo conectadas con datos en tiempo real.",
        "29": "Cube ofrece capacidades de reporting moderadas a través de su integración con Excel y Google Sheets, pero carece de dashboards nativos avanzados y visualizaciones sofisticadas en comparación con competidores especializados en reporting.",
        "30": "Cube no cuenta con herramientas de análisis de desviaciones automatizadas. Todo análisis debe realizarse manualmente en Excel/Sheets.",
        "31": "Cube no incluye funcionalidades nativas para planificación de personal ni drivers de headcount. Se podría modelar manualmente, pero no hay soporte específico documentado.",
        "32": "Cube proporciona funcionalidades básicas para proyección de ingresos, pero sus capacidades para modelado de ventas y gestión de cuotas comerciales son limitadas en comparación con soluciones más especializadas en este ámbito.",
        "33": "Cube ofrece funcionalidades básicas para análisis de flujo de caja, pero carece de herramientas avanzadas para previsión de liquidez y gestión de tesorería que otras plataformas especializadas proporcionan.",
        "34": "Cube permite realizar planificación de costos básica, pero sus capacidades para gestión detallada de gastos operativos y control presupuestario granular son menos desarrolladas que las de competidores enfocados en este aspecto."
      }
    },
    "q11_ia": {
      "question_justification": "Cube tiene capacidades de IA limitadas, con algunas funcionalidades básicas de forecasting y escenarios, pero carece de detección de anomalías avanzada, análisis de varianzas automatizado y consultas en lenguaje natural.",
      "options": {
        "47": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "48": "Cube no cuenta con herramientas de análisis de desviaciones automatizadas. Todo análisis debe realizarse manualmente en Excel/Sheets.",
        "49": "Cube permite crear escenarios manualmente en hojas conectadas, pero no dispone de un sistema avanzado de gestión de escenarios o escenarios versionados.",
        "50": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "51": "Cube permite crear dashboards en Excel y Sheets, pero no tiene motor visual propio ni drill-down interactivo nativo. Puede cubrir reporting básico si el usuario configura sus propias vistas.",
        "52": "Cube no tiene ningún tipo de asistente conversacional ni funcionalidad para consultas en lenguaje natural sobre los datos.",
        "53": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas."
      }
    },
    "q5_excel": {
      "question_justification": "Cube funciona como una capa sobre Excel y Google Sheets, manteniendo la interfaz familiar de hojas de cálculo mientras añade capacidades de FP&A, sincronización y colaboración.",
      "options": {
        "17": "Cube opera como capa encima de Excel, compatible con su funcionamiento, aunque no como add-in tradicional.",
        "18": "Cube no es independiente de Excel. Se basa completamente en su uso como interfaz y entorno de trabajo principal.",
        "19": "Cube no es independiente de Excel. Se basa completamente en su uso como interfaz y entorno de trabajo principal.",
        "20": "Cube está profundamente integrado con Excel, lo cual es útil, pero para quienes no priorizan esa relación, sigue siendo una opción válida por otras funcionalidades."
      }
    },
    "q1_size": {
      "question_justification": "Cube está orientado principalmente a empresas medianas (mid-market) y scaleups, siendo menos adecuado para corporaciones muy grandes con estructuras complejas o para startups muy pequeñas.",
      "options": {
        "0": "Cube es más adecuado para empresas mid-market y enterprise; su estructura de precios y capacidades pueden ser excesivas para startups muy pequeñas.",
        "1": "Aunque Cube apunta a mid-market, es adoptado también por scaleups con estructuras algo más complejas.",
        "2": "Cube está bien posicionado para empresas en crecimiento como scaleups y mid-market con cierta complejidad en planificación.",
        "3": "Cube tiene funcionalidades útiles para mid-market, pero puede quedarse corto frente a plataformas más enterprise en casos complejos.",
        "4": "Cube no está diseñado para corporaciones muy grandes con estructuras complejas y consolidaciones avanzadas; su enfoque es mid-market."
      }
    },
    "q2_budget": {
      "question_justification": "Cube ofrece planes desde aproximadamente 15K USD/año para equipos pequeños, escalando según usuarios y funcionalidades, con su punto óptimo en el rango de 30K-60K USD/año.",
      "options": {
        "5": "Cube no opera en el rango por debajo de 10K USD al año. Su punto de entrada ronda los $15k, por lo que no es adecuado para presupuestos muy bajos.",
        "6": "Cube puede ofrecer planes básicos o equipos pequeños dentro de este rango, aunque con funcionalidades limitadas o menor número de usuarios.",
        "7": "Este es el rango estándar para muchas implementaciones de Cube en empresas mid-market.",
        "8": "Cube puede alcanzar este rango si se requieren muchas integraciones, usuarios adicionales o soporte premium.",
        "9": "Aunque Cube puede escalar, su propuesta principal está más alineada con rangos por debajo de los 100k. No es habitual que supere ese umbral a menos que sea un uso intensivo enterprise."
      }
    },
    "q9_modeling": {
      "question_justification": "Cube proporciona capacidades de modelado intermedias, adecuadas para estructuras multidimensionales y dependencias lógicas, pero con limitaciones para modelado enterprise de alta complejidad.",
      "options": {
        "39": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "40": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "41": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas.",
        "42": "No hay evidencia clara en la ficha de Cube que respalde esta funcionalidad específica. Podría ser parcialmente replicada mediante personalización en hojas conectadas."
      }
    },
    "q6_integrations": {
      "question_justification": "Cube ofrece integraciones nativas con ERPs (NetSuite, Sage), CRMs (Salesforce), HRIS y data warehouses, destacando especialmente por su integración bidireccional con Excel y Google Sheets.",
      "options": {
        "21": "Cube ofrece conectores nativos para sincronizar datos automáticamente desde diversas fuentes como ERPs (NetSuite, Sage Intacct, QuickBooks)",
        "22": "Cube tiene integración confirmada con Salesforce como CRM principal.",
        "23": "Cube se integra con HRIS como Workday y BambooHR para datos de personal.",
        "24": "Cube permite exportar a herramientas BI como Power BI y Tableau para visualización avanzada.",
        "25": "Cube ofrece conectores con Snowflake, Redshift y BigQuery, lo que permite integrar fuentes de datos directamente para análisis financiero.",
        "26": "Cube es una capa de integración bidireccional sobre Excel y Google Sheets, núcleo de su funcionamiento.",
        "27": "Cube tiene un conjunto limitado de integraciones predefinidas y no ofrece un framework extensible para conectar con sistemas personalizados o menos comunes, lo que limita su flexibilidad para integraciones no estándar."
      }
    }
  },
  "datarails": {
    "q10_collaboration": {
      "question_justification": "Datarails ofrece capacidades de colaboración intermedias con control de versiones, comentarios y aprobaciones básicas, facilitando el trabajo en equipo sobre datos financieros consolidados.",
      "options": {
        "43": "Se puede trabajar individualmente con hojas conectadas.",
        "44": "Compartición y versiones vía archivos Excel/SharePoint.",
        "45": "Permite consolidar inputs de diferentes usuarios, pero no tiene workflows visuales propios.",
        "46": "No cuenta con motores de flujo de trabajo avanzados."
      }
    },
    "q4_time": {
      "question_justification": "Datarails permite una implementación relativamente rápida de 2-4 semanas, gracias a su enfoque de mantener las hojas de Excel existentes mientras añade automatización y consolidación.",
      "options": {
        "13": "Requiere setup e integración inicial con archivos y fuentes.",
        "14": "Posible en escenarios estándar sin integración compleja.",
        "15": "Rango habitual para implementación completa.",
        "16": "Posible pero ineficiente para una solución basada en Excel."
      }
    },
    "q13_implementation": {
      "question_justification": "Datarails es principalmente una solución cloud/SaaS, diseñada para trabajar con archivos Excel locales pero sin opciones significativas para implementación on-premise o híbrida.",
      "options": {
        "58": "Datarails es una plataforma cloud-based (SaaS).",
        "59": "No disponible en modalidad On-Premise.",
        "60": "No se soporta arquitectura híbrida."
      }
    },
    "q3_pricing": {
      "question_justification": "Datarails utiliza un modelo de suscripción anual estándar basado en usuarios, sin opciones mensuales ni modelos de pago por uso variable.",
      "options": {
        "10": "Datarails utiliza precios según usuarios y funcionalidades contratadas.",
        "11": "Modelo de suscripción anual estándar; no mensual.",
        "12": "No se adapta dinámicamente al volumen de uso, sino al número de usuarios."
      }
    },
    "q8_reporting": {
      "question_justification": "Datarails ofrece sólidas capacidades de reporting financiero con consolidación automática de datos de múltiples hojas Excel, dashboards personalizables y opciones de exportación.",
      "options": {
        "35": "Disponibles y personalizables desde entorno web y Excel.",
        "36": "Jerarquías y detalles disponibles en plantillas.",
        "37": "Soportado mediante gráficos y tablas, pero no completamente dinámico como en BI tools.",
        "38": "Sí, Storyboards lo permite directamente."
      }
    },
    "q12_scalability": {
      "question_justification": "Datarails maneja eficientemente volúmenes de datos pequeños a medianos, ideal para consolidar múltiples hojas Excel, pero puede presentar limitaciones con conjuntos de datos muy grandes o estructuras altamente complejas.",
      "options": {
        "54": "Totalmente adecuado para este rango.",
        "55": "Puede manejarlo con ciertas limitaciones inherentes a Excel.",
        "56": "No es lo más adecuado; arquitectura Excel se vuelve ineficiente.",
        "57": "No preparado para escenarios enterprise con gran volumen y automatización masiva."
      }
    },
    "q7_cases": {
      "question_justification": "Datarails destaca en consolidación financiera, presupuestos y reporting, con capacidades moderadas para forecasting y análisis de varianzas, y funcionalidades básicas para planificación de personal y ventas.",
      "options": {
        "28": "Caso de uso principal que Datarails automatiza dentro del entorno Excel.",
        "29": "Reportes financieros, dashboards, exportación a presentaciones vía Storyboards.",
        "30": "Posible a través de hojas y fórmulas, sin módulos especializados.",
        "31": "No hay evidencia de módulos específicos; podría modelarse manualmente.",
        "32": "Frecuente entre los casos de uso reportados por clientes.",
        "33": "Modelado manual desde Excel, sin motor específico dedicado.",
        "34": "Común dentro del ciclo de presupuesto en entornos Excel."
      }
    },
    "q11_ia": {
      "question_justification": "Datarails tiene capacidades de IA limitadas, con algunas funcionalidades básicas para detección de anomalías y forecasting simple, pero sin capacidades avanzadas de análisis predictivo o consultas en lenguaje natural.",
      "options": {
        "47": "No está documentado como módulo autónomo o integrado.",
        "48": "No soportado de forma automatizada.",
        "49": "No disponible como funcionalidad nativa.",
        "50": "No disponible en su stack actual.",
        "51": "Storyboards automatiza creación de presentaciones con datos financieros.",
        "52": "No se ha documentado compatibilidad con Q&A en lenguaje natural.",
        "53": "Neutral."
      }
    },
    "q5_excel": {
      "question_justification": "Datarails se integra perfectamente con Excel, permitiendo a los usuarios mantener sus hojas y modelos existentes mientras añade capacidades de consolidación, automatización y colaboración.",
      "options": {
        "17": "Datarails se apoya completamente en archivos y lógica Excel.",
        "18": "La independencia es limitada; no opera fuera de entorno Excel.",
        "19": "No es una solución independiente, depende de Excel.",
        "20": "Neutral: compatible si se desea mantener Excel."
      }
    },
    "q1_size": {
      "question_justification": "Datarails está diseñado principalmente para empresas pequeñas y medianas, siendo ideal para organizaciones de 50-500 empleados que buscan automatizar procesos financieros basados en Excel.",
      "options": {
        "0": "Datarails puede ser utilizado por empresas pequeñas, pero está mejor adaptado a estructuras financieras mínimamente establecidas.",
        "1": "Clientes en este rango pueden beneficiarse del uso de Excel consolidado automatizado.",
        "2": "Segmento ideal para Datarails: automatización sin abandonar Excel.",
        "3": "También válido para empresas medianas con múltiples entidades o consolidaciones.",
        "4": "No es el foco principal de Datarails; otras soluciones como Pigment pueden ser más apropiadas."
      }
    },
    "q2_budget": {
      "question_justification": "Datarails ofrece planes desde aproximadamente 15K USD/año, posicionándose como una solución de precio medio en el mercado FP&A, con opciones escalables según usuarios y módulos.",
      "options": {
        "5": "Precio base estimado de $24,000 USD/año; difícil ajustar a presupuestos inferiores.",
        "6": "Encaja perfectamente con el umbral inferior estimado.",
        "7": "Rango típico para planes con más usuarios y consolidación extendida.",
        "8": "Válido para clientes con integración compleja o necesidades adicionales.",
        "9": "Precio elevado para el target habitual de Datarails."
      }
    },
    "q9_modeling": {
      "question_justification": "Datarails proporciona capacidades de modelado intermedias, permitiendo mantener los modelos Excel existentes mientras añade funcionalidades de consolidación y análisis, aunque con limitaciones para modelado multidimensional muy complejo.",
      "options": {
        "39": "Ideal para usuarios que quieren mejorar planificación sin abandonar Excel.",
        "40": "Modelos financieros predefinidos pueden ser adaptados.",
        "41": "Limitado por estructura de hoja de cálculo; sin OLAP ni scripting.",
        "42": "No tiene capacidades de performance o automatización empresarial de alto nivel."
      }
    },
    "q6_integrations": {
      "question_justification": "Datarails ofrece integraciones con sistemas ERP, CRM y otras fuentes de datos empresariales, con especial énfasis en su capacidad para trabajar con archivos Excel existentes y consolidarlos.",
      "options": {
        "21": "Datarails ofrece conectores con ERP como NetSuite y Sage, aunque menos profundidad que herramientas tipo Pigment.",
        "22": "Integraciones disponibles con Salesforce y HubSpot según documentación oficial.",
        "23": "No hay evidencia de conectores específicos para sistemas de RRHH.",
        "24": "Soporta exportación y visualización, no integración directa con herramientas BI.",
        "25": "No se documenta integración directa con DWH externos.",
        "26": "Excel es el núcleo de Datarails; Google Sheets no es compatible directamente.",
        "27": "Podrían existir integraciones vía carga de Excel u otras APIs no públicas."
      }
    }
  },
  "drivetrain": {
    "q10_collaboration": {
      "question_justification": "Drivetrain ofrece capacidades de colaboración avanzadas con workflows definidos, comentarios en contexto, seguimiento granular y gestión de permisos detallada para equipos distribuidos.",
      "options": {
        "43": "Diseñada para trabajo en equipo y colaboración estructurada.",
        "44": "Posibilidad de compartir dashboards y reportes.",
        "45": "Incluye asignación de tareas, revisiones y flujos colaborativos.",
        "46": "Workflows definidos, comentarios en contexto, seguimiento granular."
      }
    },
    "q4_time": {
      "question_justification": "Drivetrain requiere una implementación moderada de 3-6 semanas debido a su arquitectura avanzada y capacidades de IA, necesitando configuración inicial de modelos y conectores de datos.",
      "options": {
        "13": "No es plug-and-play, requiere integración de datos.",
        "14": "Posible en clientes con stack listo, pero no estándar.",
        "15": "Rango típico de implementación en casos como Quantum Metric o Fermat.",
        "16": "Válido para despliegues con múltiples fuentes, departamentos o consolidaciones."
      }
    },
    "q13_implementation": {
      "question_justification": "Drivetrain es principalmente una solución cloud/SaaS con arquitectura moderna, aunque ofrece algunas opciones para escenarios híbridos en implementaciones enterprise.",
      "options": {
        "58": "Modelo nativo en la nube.",
        "59": "No disponible.",
        "60": "No se documenta compatibilidad con entornos híbridos."
      }
    },
    "q3_pricing": {
      "question_justification": "Drivetrain utiliza un modelo de suscripción anual basado en usuarios y módulos, con opciones enterprise personalizadas pero sin planes mensuales ni modelos de pago por uso variable.",
      "options": {
        "10": "Probable modelo de licencias en función de usuarios e integraciones.",
        "11": "No hay evidencia de facturación mensual estándar.",
        "12": "Podría adaptarse parcialmente a uso, pero orientado a licencias enterprise."
      }
    },
    "q8_reporting": {
      "question_justification": "Drivetrain ofrece potentes capacidades de reporting con dashboards interactivos, visualizaciones avanzadas y análisis drill-down, facilitando la comunicación de insights financieros complejos.",
      "options": {
        "35": "Visuales interactivos adaptables por equipo y rol.",
        "36": "Navegación entre niveles y detalles disponible.",
        "37": "Visualizaciones potentes con tablas y métricas vivas.",
        "38": "No está documentado como funcionalidad estándar."
      }
    },
    "q12_scalability": {
      "question_justification": "Drivetrain maneja eficientemente grandes volúmenes de datos y modelos complejos, con arquitectura optimizada para conjuntos de datos enterprise y análisis multidimensional a gran escala.",
      "options": {
        "54": "Sobrecapacitada para este rango, aunque funciona sin problema.",
        "55": "Idealmente dimensionada para estas necesidades.",
        "56": "Diseñada para manejar múltiples sistemas y ERPs a gran escala.",
        "57": "Escalable, pero aún no con la profundidad de plataformas consolidadas tipo Anaplan."
      }
    },
    "q7_cases": {
      "question_justification": "Drivetrain sobresale en forecasting avanzado, análisis de escenarios y planificación de ventas gracias a sus capacidades de IA, con sólidas funcionalidades para presupuestos, reporting y planificación de personal.",
      "options": {
        "28": "Caso de uso principal de Drivetrain, altamente automatizado.",
        "29": "Incluye visualización, jerarquías, drill-down y dashboards interactivos.",
        "30": "Escenarios soportados con IA. Variance no documentado como AI, pero manual sí.",
        "31": "Puede hacerse, pero no es un módulo separado especializado.",
        "32": "Muy enfocado a métricas SaaS como bookings, MRR, CAC, etc.",
        "33": "Posible a través de modelos personalizados.",
        "34": "Parte del flujo de planificación operativa y financiera."
      }
    },
    "q11_ia": {
      "question_justification": "Drivetrain destaca por sus capacidades de IA superiores en todas las áreas: forecasting automático, análisis predictivo, detección de anomalías, planificación de escenarios y generación de insights basados en datos.",
      "options": {
        "47": "Motor de forecasting impulsado por IA.",
        "48": "No se documenta como función automatizada específica.",
        "49": "Modelado dinámico de escenarios impulsado por AI.",
        "50": "No documentado como funcionalidad propia.",
        "51": "Insights sí, aunque no narrativas automáticas tipo storytelling.",
        "52": "No disponible.",
        "53": "Neutral."
      }
    },
    "q5_excel": {
      "question_justification": "Drivetrain ofrece integración con Excel para importación y exportación de datos, pero es una plataforma independiente con su propia interfaz y modelado, no dependiente de hojas de cálculo.",
      "options": {
        "17": "Tiene integración, pero no trabaja embebida en Excel.",
        "18": "Ideal: integra con Excel, pero trabaja desde entorno 100% en la nube.",
        "19": "Drivetrain puede trabajar sin depender de Excel.",
        "20": "Neutral: compatible con Excel y otras fuentes."
      }
    },
    "q1_size": {
      "question_justification": "Drivetrain está orientado principalmente a empresas medianas y grandes, siendo más adecuado para organizaciones de 200+ empleados con necesidades de planificación financiera avanzada y basada en IA.",
      "options": {
        "0": "Aunque Drivetrain es flexible, su foco está en estructuras más complejas.",
        "1": "Podría aplicarse a scale-ups que requieren integración de métricas avanzadas.",
        "2": "Segmento ideal: empresas en crecimiento con necesidades de consolidación y forecasting.",
        "3": "Casos como Mindtickle o Quartzy demuestran fuerte orientación a mid-market.",
        "4": "Drivetrain puede escalar, aunque no tiene fuerte presencia enterprise todavía."
      }
    },
    "q2_budget": {
      "question_justification": "Drivetrain se posiciona en el segmento premium del mercado FP&A, con planes que típicamente superan los 30K USD/año, escalando según usuarios, módulos y volumen de datos.",
      "options": {
        "5": "No está diseñada para presupuestos bajos.",
        "6": "Podría ser el punto de entrada con funcionalidades limitadas.",
        "7": "Rango de precios razonable para equipos medianos.",
        "8": "Target natural para implementación completa y soporte empresarial.",
        "9": "Posible para despliegues complejos y múltiples usuarios."
      }
    },
    "q9_modeling": {
      "question_justification": "Drivetrain proporciona capacidades de modelado avanzadas y enterprise-level, soportando estructuras multidimensionales complejas, numerosos drivers y automatización sofisticada basada en IA.",
      "options": {
        "39": "Puede utilizarse de forma simple, aunque está pensado para mayor complejidad.",
        "40": "Ideal para modelado con fórmulas sin código y múltiples dimensiones.",
        "41": "Permite modelar consolidaciones, escenarios, dependencias y multiunidad.",
        "42": "No es tan maduro como Anaplan, pero escala a estructuras complejas."
      }
    },
    "q6_integrations": {
      "question_justification": "Drivetrain proporciona robustas integraciones con sistemas ERP, CRM, HRIS y data warehouses, con conectores avanzados que facilitan la incorporación de datos de múltiples fuentes empresariales.",
      "options": {
        "21": "Drivetrain tiene conectores con NetSuite, QuickBooks, Xero y otros ERPs.",
        "22": "Soporta integración directa con CRMs como Salesforce y HubSpot.",
        "23": "Incluye conectividad con Workday y ADP.",
        "24": "Compatible con Power BI, Looker y Tableau, aunque no es una herramienta BI nativa.",
        "25": "Aunque no específico, integración vía API y conectores es probable.",
        "26": "Compatible con ambos para entrada y salida de datos.",
        "27": "Más de 200 integraciones cubren la mayoría de escenarios comunes."
      }
    }
  },
  "jirav": {
    "q10_collaboration": {
      "question_justification": "Jirav ofrece capacidades de colaboración intermedias con comentarios, notificaciones y permisos básicos, facilitando el trabajo en equipo para organizaciones pequeñas y medianas.",
      "options": {
        "43": "Puede usarse de forma individual, aunque su ventaja está en la colaboración.",
        "44": "Permite control de acceso y comentarios simples.",
        "45": "Seguimiento de contribuciones y colaboración con equipos contables/FP&A.",
        "46": "No incluye motor de tareas o workflows con dependencias."
      }
    },
    "q4_time": {
      "question_justification": "Jirav permite una implementación relativamente rápida de 1-3 semanas, con plantillas predefinidas y configuración simplificada que acelera la puesta en marcha.",
      "options": {
        "13": "No es inmediato, pero es una de las herramientas más ágiles del mercado.",
        "14": "Implementación rápida y guiada para la mayoría de clientes SMB.",
        "15": "También posible, dependiendo del nivel de personalización y conectores.",
        "16": "No habitual para este tipo de herramientas."
      }
    },
    "q13_implementation": {
      "question_justification": "Jirav es exclusivamente una solución cloud/SaaS, sin opciones on-premise o híbridas, diseñada para implementación rápida y mantenimiento simplificado.",
      "options": {
        "58": "Modelo nativo 100% SaaS basado en navegador.",
        "59": "No disponible.",
        "60": "No contemplado."
      }
    },
    "q3_pricing": {
      "question_justification": "Jirav utiliza un modelo de suscripción anual basado en usuarios, con planes escalonados según funcionalidades, pero sin opciones mensuales ni modelos de pago por uso variable.",
      "options": {
        "10": "Modelo más común en Jirav, escalable según número de usuarios y módulos.",
        "11": "Se factura anualmente en la mayoría de los casos.",
        "12": "Parcialmente, dependiendo del volumen de usuarios y conectores."
      }
    },
    "q8_reporting": {
      "question_justification": "Jirav ofrece sólidas capacidades de reporting financiero con dashboards personalizables, visualizaciones intuitivas y opciones de exportación, diseñadas para ser accesibles a usuarios no técnicos.",
      "options": {
        "35": "Sí, interfaz visual intuitiva y con granularidad editable.",
        "36": "Soporta navegación por jerarquías aunque no tan avanzada como soluciones enterprise.",
        "37": "Interactividad adecuada para SMBs; limitado frente a BI tools.",
        "38": "Soportado para compartir resultados con stakeholders."
      }
    },
    "q12_scalability": {
      "question_justification": "Jirav maneja eficientemente volúmenes de datos pequeños a medianos, ideal para SMBs, pero puede presentar limitaciones con conjuntos de datos muy grandes o estructuras altamente complejas típicas de grandes corporaciones.",
      "options": {
        "54": "Perfecto para este nivel de datos financieros.",
        "55": "Puede adaptarse pero sin motor de alto rendimiento.",
        "56": "No optimizado para datos masivos o financieros complejos multimoneda.",
        "57": "No es solución diseñada para grandes empresas ni alta complejidad."
      }
    },
    "q7_cases": {
      "question_justification": "Jirav destaca en presupuestos, forecasting y reporting para pequeñas y medianas empresas, con capacidades moderadas para análisis de varianzas y planificación de personal, y funcionalidades básicas para escenarios complejos.",
      "options": {
        "28": "Caso de uso principal de Jirav: forecast rolling, modelos driver-based.",
        "29": "Incluye dashboards personalizables con vista ejecutiva y operativa.",
        "30": "What-if scenarios disponibles, análisis de desviaciones manual.",
        "31": "Posible modelar empleados, pero no es módulo dedicado.",
        "32": "Incluido como caso frecuente, especialmente para SaaS.",
        "33": "Modelos predefinidos para cash flow directo.",
        "34": "Control y modelado de gastos operativos por categoría y función."
      }
    },
    "q11_ia": {
      "question_justification": "Jirav tiene capacidades de IA moderadas, con algunas funcionalidades para forecasting automático y análisis básico, pero sin capacidades avanzadas de análisis predictivo o consultas en lenguaje natural.",
      "options": {
        "47": "Utiliza automatización y lógica basada en controladores, no algoritmos AI predictivos avanzados.",
        "48": "No disponible como módulo automatizado.",
        "49": "Escenarios disponibles pero no impulsados por IA.",
        "50": "No disponible.",
        "51": "Sin módulo narrativo, reporting es visual pero no automatizado vía IA.",
        "52": "No disponible.",
        "53": "Neutral."
      }
    },
    "q5_excel": {
      "question_justification": "Jirav es una plataforma independiente con su propia interfaz, aunque ofrece importación y exportación de datos desde Excel, no depende de hojas de cálculo para su funcionamiento.",
      "options": {
        "17": "No es un add-in, pero permite importar/exportar fácilmente.",
        "18": "Ideal: se independiza de Excel, pero se conecta sin fricción.",
        "19": "Funciona sin depender de Excel, pero permite seguir usándolo como input/export.",
        "20": "Compatible en ambos sentidos."
      }
    },
    "q1_size": {
      "question_justification": "Jirav está orientado principalmente a pequeñas y medianas empresas, siendo ideal para organizaciones de 10-200 empleados que buscan una solución FP&A accesible y fácil de implementar.",
      "options": {
        "0": "Jirav puede ser utilizado por empresas pequeñas, aunque se recomienda para estructuras con algo más de complejidad.",
        "1": "Ideal para startups en crecimiento que necesitan planificación y dashboards sin abandonar Excel completamente.",
        "2": "Core target de Jirav: empresas SMB que buscan control y automatización financiera.",
        "3": "Aplicable, aunque hay opciones más robustas para estructuras mayores.",
        "4": "No es el público objetivo principal de Jirav."
      }
    },
    "q2_budget": {
      "question_justification": "Jirav ofrece planes desde aproximadamente 12K USD/año, posicionándose como una alternativa más económica en el mercado FP&A, con opciones escalables según usuarios y funcionalidades.",
      "options": {
        "5": "Puede haber alguna entrada limitada, pero es raro ver proyectos Jirav por debajo de $10K/año.",
        "6": "Segmento ideal de precio, especialmente para empresas de 11 a 200 empleados.",
        "7": "Posible para implementaciones con múltiples usuarios y dashboards avanzados.",
        "8": "No es el ticket promedio más frecuente para Jirav.",
        "9": "No diseñado para despliegues tan amplios."
      }
    },
    "q9_modeling": {
      "question_justification": "Jirav proporciona capacidades de modelado intermedias, adecuadas para estructuras financieras estándar y dependencias básicas, aunque con limitaciones para modelado multidimensional muy complejo o casos enterprise.",
      "options": {
        "39": "Ideal para clientes que quieren independencia de Excel sin complejidad de herramientas tipo Anaplan.",
        "40": "Su propuesta más fuerte: modelado de ingresos, costes y personal driver-based con lógica simple.",
        "41": "Menos flexible para modelado financiero multientidad avanzado.",
        "42": "No optimizada para estructuras con cientos de centros de coste o consolidación global."
      }
    },
    "q6_integrations": {
      "question_justification": "Jirav ofrece integraciones nativas con QuickBooks, Xero, NetSuite y otros ERPs populares para SMBs, así como con CRMs como Salesforce, facilitando la consolidación de datos financieros y operativos.",
      "options": {
        "21": "Jirav ofrece integraciones nativas con QuickBooks, Xero, NetSuite y otros ERPs populares para SMBs.",
        "22": "Integra con Salesforce. No se documenta integración con CRMs menos comunes.",
        "23": "Poca información sobre integraciones con plataformas de RRHH o nómina.",
        "24": "No diseñado para extender dashboards hacia herramientas BI externas.",
        "25": "No se documenta integración directa con DWH.",
        "26": "Soporta importación/exportación desde y hacia Excel y Google Sheets.",
        "27": "Tiene API abierta para conexiones adicionales."
      }
    }
  },
  "mosaic": {
    "q10_collaboration": {
      "question_justification": "Mosaic ofrece sólidas capacidades de colaboración con comentarios contextuales, notificaciones y permisos detallados, diseñadas para equipos financieros y operativos de empresas de rápido crecimiento.",
      "options": {
        "43": "Mosaic está pensado para colaboración estructurada. Puede estar sobredimensionado para trabajo individual.",
        "44": "Ofrece herramientas de colaboración básicas: control de acceso, historial, input tracking.",
        "45": "Workflows típicos de forecast, cierre mensual y presentaciones están bien soportados.",
        "46": "Carece de un gestor de tareas autónomo o vista tipo project manager."
      }
    },
    "q4_time": {
      "question_justification": "Mosaic permite una implementación moderada de 2-4 semanas, con conectores predefinidos que aceleran la integración con sistemas financieros y operativos existentes.",
      "options": {
        "13": "No es plug-and-play. Requiere mapeo de datos, configuración inicial y entrenamiento.",
        "14": "En empresas pequeñas bien organizadas puede lograrse una implementación rápida, pero no es la norma.",
        "15": "Plazo estándar de onboarding, integraciones y dashboards funcionales para equipos FP&A.",
        "16": "Puede ocurrir en entornos complejos o con múltiples ERPs/CRMs, aunque no es lo habitual."
      }
    },
    "q13_implementation": {
      "question_justification": "Mosaic es exclusivamente una solución cloud/SaaS con arquitectura moderna, sin opciones on-premise, alineada con las preferencias de implementación de startups y empresas tecnológicas.",
      "options": {
        "58": "Mosaic es 100% SaaS y no requiere instalación local. El acceso es vía navegador.",
        "59": "No disponible. No se ofrece instalación local de ningún tipo.",
        "60": "No soporta integración híbrida. Todas las operaciones se realizan en entorno cloud."
      }
    },
    "q3_pricing": {
      "question_justification": "Mosaic utiliza un modelo de suscripción anual basado en usuarios y módulos, con planes enterprise personalizados pero sin opciones mensuales ni modelos de pago por uso variable.",
      "options": {
        "10": "Este es el modelo más común de Mosaic, escalando según el número de licencias activas.",
        "11": "No hay evidencia de planes mensuales; Mosaic funciona bajo suscripción anual.",
        "12": "Se adapta parcialmente al uso funcional y a los módulos contratados."
      }
    },
    "q8_reporting": {
      "question_justification": "Mosaic ofrece potentes capacidades de reporting con dashboards interactivos, visualizaciones modernas y métricas específicas para startups y empresas SaaS, facilitando la comunicación de KPIs financieros y operativos.",
      "options": {
        "35": "Mosaic permite crear dashboards adaptados a cada usuario o área con KPIs clave.",
        "36": "Navegación desde vista global hasta niveles de cuenta o transacción.",
        "37": "Visualizaciones dinámicas pero limitadas frente a herramientas BI especializadas.",
        "38": "Sí. Generación automática de reportes ejecutivos para presentación a stakeholders."
      }
    },
    "q12_scalability": {
      "question_justification": "Mosaic maneja eficientemente volúmenes de datos medianos a grandes, con arquitectura diseñada para escalar con empresas de rápido crecimiento y soportar análisis complejos de métricas operativas y financieras.",
      "options": {
        "54": "Mosaic puede operar con eficiencia en este rango, aunque puede estar sobredimensionado.",
        "55": "Ideal para empresas con volumen mediano de datos financieros multidimensionales.",
        "56": "Puede gestionar grandes volúmenes si la arquitectura de carga está bien diseñada.",
        "57": "Mosaic no es una herramienta enterprise big data, pero puede escalar razonablemente con estrategia de carga y consolidación."
      }
    },
    "q7_cases": {
      "question_justification": "Mosaic destaca en forecasting, análisis de métricas SaaS/tecnológicas y reporting estratégico, con sólidas capacidades para presupuestos, análisis de escenarios y planificación de ventas orientada a empresas de alto crecimiento.",
      "options": {
        "28": "Mosaic está construido específicamente para planificación financiera ágil y rolling forecast.",
        "29": "Ofrece dashboards personalizables, KPIs financieros, reporting ejecutivo con drill-down.",
        "30": "Permite escenarios personalizados y análisis comparativo, aunque el análisis de desviaciones no está 100% automatizado.",
        "31": "Es posible modelarlo, pero no es un módulo autónomo con UI específica para headcount.",
        "32": "Integra datos de CRM para realizar modelos de ingresos con base en pipelines y revenue streams.",
        "33": "Modelo de flujo de caja directo e indirecto disponible, con drivers de gasto operativo y receivables.",
        "34": "Soporta drivers personalizados y análisis de costes, aunque sin granularidad contable completa."
      }
    },
    "q11_ia": {
      "question_justification": "Mosaic incorpora capacidades de IA avanzadas para forecasting, detección de anomalías y análisis de tendencias, especialmente optimizadas para métricas y patrones típicos de empresas tecnológicas y SaaS.",
      "options": {
        "47": "Mosaic aplica machine learning para forecast predictivo. No es configurable por el usuario, pero mejora la precisión con datos históricos.",
        "48": "No ofrece un módulo específico de análisis de desviaciones automatizado.",
        "49": "Permite creación y análisis de escenarios complejos con drivers múltiples y ajustes instantáneos.",
        "50": "No se documenta detección automática de anomalías.",
        "51": "Genera recomendaciones y alertas desde los dashboards y evolución de KPIs.",
        "52": "No se ha documentado la existencia de un asistente conversacional o buscador por lenguaje natural.",
        "53": "Valor neutral si no se requiere funcionalidad AI."
      }
    },
    "q5_excel": {
      "question_justification": "Mosaic es una plataforma independiente con su propia interfaz, aunque ofrece buena integración con Excel para importación y exportación de datos, no depende de hojas de cálculo para su funcionamiento.",
      "options": {
        "17": "Mosaic no es un add-in de Excel, pero permite exportar/importar datos.",
        "18": "Este es el enfoque de Mosaic: independencia pero compatibilidad con hojas de cálculo.",
        "19": "Mosaic opera completamente fuera de Excel, aunque ofrece interoperabilidad para usuarios acostumbrados a hojas de cálculo.",
        "20": "La dependencia de Excel no limita ni potencia el uso de Mosaic; es neutro."
      }
    },
    "q1_size": {
      "question_justification": "Mosaic está orientado principalmente a startups de rápido crecimiento y empresas medianas, siendo ideal para organizaciones de 50-500 empleados en sectores tecnológicos y de alto crecimiento.",
      "options": {
        "0": "Mosaic es una plataforma diseñada para equipos financieros con estructura mínima. Empresas muy pequeñas pueden encontrarla sobredimensionada.",
        "1": "Es viable, pero el coste y la configuración inicial pueden ser una barrera en este segmento.",
        "2": "Este rango representa el núcleo objetivo de Mosaic: empresas en crecimiento que requieren control y planificación colaborativa.",
        "3": "Mosaic escala bien para empresas mid-market, permitiendo consolidación y colaboración estructurada.",
        "4": "Es posible adaptarla a entornos enterprise, aunque no es su posicionamiento nativo frente a herramientas como Anaplan."
      }
    },
    "q2_budget": {
      "question_justification": "Mosaic ofrece planes desde aproximadamente 20K USD/año, posicionándose en el segmento medio-alto del mercado FP&A, con opciones escalables según usuarios y funcionalidades.",
      "options": {
        "5": "No está pensada para presupuestos bajos. No se ofrecen versiones self-service de bajo coste.",
        "6": "Este rango puede permitir el acceso a funcionalidades básicas o pilotos con usuarios limitados.",
        "7": "Es el rango habitual para empresas mid-market usando Mosaic en varios equipos.",
        "8": "Empresas que requieren múltiples integraciones o mayor personalización pueden entrar aquí.",
        "9": "Mosaic puede alcanzar este nivel en clientes grandes, aunque es menos habitual."
      }
    },
    "q9_modeling": {
      "question_justification": "Mosaic proporciona capacidades de modelado avanzadas, especialmente optimizadas para métricas y modelos típicos de empresas SaaS y tecnológicas, con buen soporte para estructuras multidimensionales.",
      "options": {
        "39": "Puede ser complejo para perfiles sin background financiero o sin onboarding adecuado.",
        "40": "Diseñado para FP&A con experiencia que busca centralizar y automatizar procesos sin código.",
        "41": "Permite consolidaciones, escenarios múltiples, modelos multientidad con drivers propios.",
        "42": "No es una solución pensada para grandes conglomerados ni estructuras multinacionales complejas."
      }
    },
    "q6_integrations": {
      "question_justification": "Mosaic proporciona robustas integraciones con sistemas ERP, CRM (especialmente Salesforce), HRIS y herramientas específicas para startups y empresas tecnológicas.",
      "options": {
        "21": "Mosaic ofrece conectores nativos con NetSuite y QuickBooks, integraciones muy demandadas por equipos financieros.",
        "22": "Soporta integración con Salesforce. Otros como HubSpot pueden requerir conexión vía API.",
        "23": "Soporta BambooHR y Gusto. No documenta integración con Workday.",
        "24": "No está diseñado para integrarse con herramientas de BI externas. Utiliza su propio módulo de reporting.",
        "25": "Posible conexión vía API abierta, pero no hay conectores nativos documentados.",
        "26": "Alta compatibilidad bidireccional con hojas de cálculo. Import/export disponible.",
        "27": "Puede integrarse con otros sistemas mediante API pública, pero requiere soporte técnico."
      }
    }
  },
  "pigment": {
    "q10_collaboration": {
      "question_justification": "Pigment proporciona capacidades de colaboración avanzadas con gestión granular de permisos, workflows de aprobación robustos y colaboración en tiempo real entre múltiples equipos.",
      "options": {
        "43": "Pigment puede utilizarse individualmente, pero está diseñado para colaboración, lo que puede resultar en complejidad innecesaria y costos elevados para uso personal exclusivo.",
        "44": "Pigment ofrece sólidas capacidades para compartir datos y edición manual, superando las expectativas básicas con funcionalidades intuitivas que facilitan la colaboración simple.",
        "45": "Pigment proporciona robustos workflows de aprobación, comentarios contextuales y seguimiento detallado de cambios, con una interfaz intuitiva que facilita la colaboración estructurada.",
        "46": "Pigment sobresale en colaboración avanzada con gestión granular de permisos, potente automatización de tareas y capacidades superiores para colaboración en tiempo real entre múltiples equipos."
      }
    },
    "q4_time": {
      "question_justification": "La implementación de Pigment varía según la complejidad del cliente, aunque no es una solución plug & play. Suele oscilar entre semanas y varios meses.",
      "options": {
        "13": "Pigment requiere implementación técnica, no es plug & play.",
        "14": "Implementaciones aceleradas son posibles, aunque poco comunes.",
        "15": "Ventana típica estimada en proyectos estándar.",
        "16": "Aplicable para despliegues complejos y multinacionales."
      }
    },
    "q13_implementation": {
      "question_justification": "Pigment es principalmente una solución cloud/SaaS con arquitectura moderna, con opciones muy limitadas para implementación on-premise o híbrida.",
      "options": {
        "58": "Aunque Pigment es principalmente una solución SaaS/Cloud, su enfoque enterprise y complejidad pueden resultar excesivos para usuarios que buscan una solución cloud simple y ligera.",
        "59": "Pigment no ofrece una verdadera opción on-premise, siendo fundamentalmente una solución cloud que no satisface los requisitos de organizaciones que necesitan implementación completamente local.",
        "60": "Pigment carece de opciones híbridas reales, centrándose exclusivamente en su modelo cloud sin alternativas viables para organizaciones que requieren una combinación de implementación cloud y on-premise."
      }
    },
    "q3_pricing": {
      "question_justification": "Pigment ofrece precios anuales y escalables según número de usuarios y módulos activados. No tiene pricing mensual ni por uso.",
      "options": {
        "10": "Modelo basado en perfiles y tipos de usuarios (viewers, contributors).",
        "11": "No aplica, precios anuales.",
        "12": "No documentado como modelo por uso variable."
      }
    },
    "q8_reporting": {
      "question_justification": "Pigment ofrece sólidas capacidades de reporting financiero básico y avanzado, con dashboards personalizables y análisis visual, aunque requiere cierta curva de aprendizaje comparado con herramientas especializadas en visualización.",
      "options": {
        "35": "Pigment ofrece dashboards personalizables con buenas opciones de visualización, pero requiere cierta curva de aprendizaje para aprovechar completamente sus capacidades. No es tan intuitivo como algunas soluciones centradas exclusivamente en visualización.",
        "36": "Pigment ofrece capacidades moderadas para reportes ejecutivos con drill-down, pero requiere configuración adicional para optimizar la experiencia de navegación en comparación con soluciones especializadas en BI.",
        "37": "Pigment proporciona herramientas de análisis visual interactivo con funcionalidades estándar, aunque no alcanza la sofisticación de plataformas dedicadas exclusivamente a visualización de datos.",
        "38": "Pigment ofrece opciones básicas para exportar a PowerPoint/PDF, pero carece de algunas funcionalidades avanzadas de formateo y personalización que ofrecen herramientas más especializadas en presentaciones."
      }
    },
    "q12_scalability": {
      "question_justification": "Pigment sobresale con conjuntos de datos grandes y complejos, demostrando excelente rendimiento incluso con millones de filas e integrándose perfectamente con data lakes para necesidades enterprise.",
      "options": {
        "54": "Pigment puede manejar volúmenes pequeños de datos, pero su arquitectura está optimizada para conjuntos más grandes, lo que puede resultar en cierta sobrecarga para necesidades modestas.",
        "55": "Pigment gestiona eficientemente volúmenes intermedios de datos, ofreciendo buen rendimiento y capacidades analíticas para conjuntos entre 50K y 1M de filas, con tiempos de respuesta rápidos.",
        "56": "Pigment sobresale con conjuntos de datos grandes, manteniendo excelente rendimiento incluso con millones de filas gracias a su arquitectura moderna y optimizada para análisis de grandes volúmenes.",
        "57": "Pigment demuestra capacidades enterprise-level excepcionales, procesando eficientemente más de 10M de filas e integrándose perfectamente con data lakes, como evidencian implementaciones en grandes corporaciones."
      }
    },
    "q7_cases": {
      "question_justification": "Pigment sobresale en todos los casos de uso FP&A principales, con capacidades superiores para presupuestos, forecasting, análisis de escenarios y planificación de personal, respaldadas por su tecnología nativa de IA.",
      "options": {
        "28": "Pigment sobresale en presupuestos y previsiones con sus capacidades nativas de IA, permitiendo crear previsiones continuas con alta precisión y frecuencia. Sus clientes enterprise como Snowflake y Unilever validan su excelencia en esta área.",
        "29": "Pigment destaca por sus potentes capacidades de visualización y dashboards interactivos, ofreciendo herramientas avanzadas para crear reportes financieros personalizados con visualizaciones de alta calidad que facilitan la toma de decisiones.",
        "30": "Pigment es particularmente fuerte en análisis de varianzas y planificación de escenarios gracias a su tecnología de IA nativa, permitiendo modelar múltiples escenarios complejos y analizar desviaciones con gran precisión y facilidad.",
        "31": "Pigment ofrece capacidades superiores para planificación de personal, con modelos detallados para costos laborales, contrataciones y análisis de impacto, respaldado por su arquitectura flexible y herramientas de visualización avanzadas.",
        "32": "Pigment proporciona herramientas de primer nivel para proyección de ingresos y modelado de ventas, con capacidades de IA que mejoran significativamente la precisión de las previsiones y facilitan la gestión de cuotas comerciales complejas.",
        "33": "Pigment ofrece sólidas capacidades para análisis de flujo de caja y previsión de liquidez, aunque no alcanza la especialización de herramientas dedicadas exclusivamente a tesorería. Su enfoque integrado proporciona buena visibilidad financiera.",
        "34": "Pigment proporciona robustas funcionalidades para planificación de costos y gestión de gastos operativos, con buenas capacidades de modelado y seguimiento, aunque algunas soluciones más especializadas ofrecen controles más granulares."
      }
    },
    "q11_ia": {
      "question_justification": "Pigment ofrece capacidades de IA avanzadas en todas las áreas clave: forecasting automático, análisis de varianzas, planificación de escenarios, detección de anomalías, reporting automático y consultas en lenguaje natural.",
      "options": {
        "47": "Pigment ofrece potentes capacidades de AI Forecasting con modelos estadísticos avanzados que generan previsiones precisas, aunque algunas configuraciones muy específicas pueden requerir ajustes manuales.",
        "48": "Pigment proporciona sólidas capacidades de análisis de varianzas mediante IA, identificando y explicando automáticamente desviaciones significativas, aunque algunos análisis muy complejos pueden requerir interpretación adicional.",
        "49": "Pigment ofrece avanzadas capacidades de planificación de escenarios con IA que generan automáticamente análisis what-if basados en cambios de supuestos, con buena precisión y facilidad de uso.",
        "50": "Pigment incluye potentes algoritmos de detección de anomalías que identifican automáticamente errores y patrones inusuales en los datos financieros, aunque algunos casos extremadamente sutiles pueden requerir revisión.",
        "51": "Pigment proporciona sólidas capacidades de generación automática de informes e insights mediante IA, creando resúmenes relevantes y visualizaciones significativas con mínima intervención manual.",
        "52": "Pigment ofrece capacidades avanzadas de consulta en lenguaje natural que permiten a los usuarios obtener información financiera compleja mediante preguntas conversacionales, con buena precisión en la mayoría de los casos.",
        "53": "Pigment está fuertemente orientado a capacidades de IA, lo que puede resultar en complejidad y costos innecesarios para usuarios que no requieren estas funcionalidades avanzadas."
      }
    },
    "q5_excel": {
      "question_justification": "Pigment opera como una plataforma independiente de Excel, aunque permite conectividad nativa para importar y exportar datos.",
      "options": {
        "17": "No funciona dentro de Excel. No es un add-in.",
        "18": "Se integra con Excel a través de conectores.",
        "19": "Pigment opera como plataforma independiente, sin requerir Excel.",
        "20": "Compatible con cualquier enfoque."
      }
    },
    "q1_size": {
      "question_justification": "Pigment está dirigido a empresas de tamaño medio a grande. Su target principal son organizaciones entre 200 y más de 1.000 empleados, como Klarna, Figma, Deliveroo o Webhelp.",
      "options": {
        "0": "Pigment está diseñado para Mid-market y Enterprise. Este tamaño queda fuera de su foco.",
        "1": "Todavía bajo para su target típico.",
        "2": "Limítrofe, pero podrían ser clientes en fase de escalado.",
        "3": "Dentro del target principal según ficha técnica.",
        "4": "Dentro del target Enterprise confirmado por múltiples clientes de referencia."
      }
    },
    "q2_budget": {
      "question_justification": "El coste estimado de Pigment va desde $30K hasta más de $200K anuales, dependiendo de la escala del cliente.",
      "options": {
        "5": "Muy por debajo del rango mínimo estimado de $30K.",
        "6": "En el umbral bajo, aunque difícilmente viable.",
        "7": "Rango bajo de entrada a Pigment.",
        "8": "Dentro del rango habitual.",
        "9": "Coincide con parte alta del rango ($200K)."
      }
    },
    "q9_modeling": {
      "question_justification": "Pigment destaca en modelado avanzado y enterprise-level con capacidades multidimensionales superiores, aunque puede resultar excesivamente complejo para necesidades básicas de modelado.",
      "options": {
        "39": "Pigment está optimizado para modelado complejo y puede resultar excesivo para necesidades básicas, con una curva de aprendizaje más pronunciada que soluciones más simples para cálculos elementales.",
        "40": "Pigment se destaca en modelado multidimensional con sólidas capacidades para establecer dependencias lógicas entre datos, ofreciendo un buen equilibrio entre potencia y usabilidad para este nivel.",
        "41": "Pigment destaca en modelado multidimensional avanzado con capacidad superior para manejar drivers personalizados y cálculos complejos, respaldado por su arquitectura moderna y tecnología de IA.",
        "42": "Pigment ofrece capacidades enterprise-level con dimensiones prácticamente ilimitadas y automatización avanzada, como demuestran implementaciones en grandes corporaciones como Unilever y Siemens."
      }
    },
    "q6_integrations": {
      "question_justification": "Pigment ofrece robustas integraciones con ERPs, CRMs y HRIS, destacando especialmente en su conexión con data warehouses como Snowflake. Su integración con Excel/Sheets es funcional pero no tan fluida como soluciones nativas.",
      "options": {
        "21": "Pigment ofrece integraciones nativas con ERP como NetSuite y SAP. Las integraciones con otros como Sage o Workday pueden realizarse mediante conectores ETL o API.",
        "22": "Pigment tiene integración directa con Salesforce mediante conectores y API. La conexión con otros CRMs como HubSpot puede requerir herramientas intermedias.",
        "23": "Pigment permite integrar datos de RRHH a través de conectores como Workday o BambooHR, ya sea mediante APIs o herramientas ETL externas.",
        "24": "Pigment no tiene integración directa con herramientas BI como Tableau o Power BI. Los datos deben exportarse y visualizarse externamente.",
        "25": "Pigment destaca por sus excelentes integraciones con data warehouses modernos como Snowflake (siendo cliente destacado), ofreciendo conectores nativos optimizados que aprovechan al máximo las capacidades de estas plataformas.",
        "26": "Pigment ofrece integración con Google Sheets y Excel, pero no es tan fluida como otras soluciones que están construidas nativamente sobre estas plataformas. La integración es funcional pero requiere algunos pasos adicionales.",
        "27": "Aunque Pigment tiene buenas integraciones con sistemas comunes, su capacidad para conectar con sistemas altamente personalizados o específicos de nicho es limitada, requiriendo desarrollo adicional para casos no estándar."
      }
    }
  },
  "vena": {
    "q10_collaboration": {
      "question_justification": "Vena ofrece sólidas capacidades de colaboración con workflows de aprobación, control de versiones, comentarios contextuales y permisos detallados para equipos financieros distribuidos.",
      "options": {
        "43": "Vena está enfocado en colaboración estructurada. No está pensado para trabajo individual sin proceso.",
        "44": "Permite asignación de tareas y seguimiento simple en panel central.",
        "45": "Workflows definidos, reglas de aprobación, cierre por pasos, notificaciones.",
        "46": "No incluye sistema de tareas tipo project manager, pero sí procesos financieros completos."
      }
    },
    "q4_time": {
      "question_justification": "Vena requiere una implementación moderada de 3-6 semanas, con tiempo adicional para configurar integraciones complejas y migrar modelos Excel existentes a la plataforma.",
      "options": {
        "13": "Vena requiere onboarding, integración y entrenamiento, especialmente por su base Excel.",
        "14": "Posible para pilotos reducidos o pruebas de concepto sin cargas externas.",
        "15": "Plazo típico para implementación de plantillas, integración de sistemas y entrenamiento.",
        "16": "Para empresas con mucha personalización o plantillas complejas, puede extenderse más."
      }
    },
    "q13_implementation": {
      "question_justification": "Vena es principalmente una solución cloud/SaaS, aunque ofrece algunas opciones para escenarios híbridos en implementaciones enterprise con requisitos específicos.",
      "options": {
        "58": "Vena es una solución SaaS basada en Microsoft Azure.",
        "59": "No está disponible en modalidad on-premise.",
        "60": "No ofrece opciones híbridas, aunque trabaja con datos locales mediante Excel."
      }
    },
    "q3_pricing": {
      "question_justification": "Vena utiliza un modelo de suscripción anual basado en usuarios y módulos, con planes enterprise personalizados pero sin opciones mensuales ni modelos de pago por uso variable.",
      "options": {
        "10": "Modelo estándar de Vena: usuarios con roles diferenciados.",
        "11": "No es habitual. Vena ofrece licencias anuales, no contratos mensuales.",
        "12": "Ciertas funcionalidades pueden ser escaladas, aunque no hay precios dinámicos según volumen."
      }
    },
    "q8_reporting": {
      "question_justification": "Vena ofrece potentes capacidades de reporting financiero con consolidación automática, dashboards personalizables y opciones avanzadas de análisis, manteniendo la familiaridad de Excel para los usuarios.",
      "options": {
        "35": "Paneles de control configurables con Power BI embebido.",
        "36": "Excel permite drill-down por celdas conectadas.",
        "37": "Limitado en Excel, pero se extiende con herramientas BI conectadas.",
        "38": "Fuerte integración con Office permite exportaciones en múltiples formatos."
      }
    },
    "q12_scalability": {
      "question_justification": "Vena maneja eficientemente volúmenes de datos medianos a grandes, con arquitectura diseñada para soportar consolidación financiera compleja y análisis multidimensional a nivel enterprise.",
      "options": {
        "54": "Ideal para estructuras de pequeña a media escala sin exceso de granularidad.",
        "55": "Escala adecuadamente en contextos mid-market bien diseñados.",
        "56": "Puede operar, pero el rendimiento dependerá de la optimización de plantillas y consultas.",
        "57": "Puede resultar insuficiente frente a necesidades complejas de conglomerados multinacionales."
      }
    },
    "q7_cases": {
      "question_justification": "Vena destaca en presupuestos, consolidación financiera y reporting, con sólidas capacidades para forecasting y análisis de varianzas, y funcionalidades moderadas para planificación de personal y ventas.",
      "options": {
        "28": "Núcleo funcional de Vena. Excelente para presupuestación y forecast sobre Excel.",
        "29": "Reporting en Excel + dashboards embebidos de Power BI.",
        "30": "Puede manejar análisis de desviaciones y escenarios mediante versiones.",
        "31": "Disponible como módulo; usado comúnmente en FP&A para headcount y sueldos.",
        "32": "Puede construirse, pero no está optimizado para datos provenientes de CRMs.",
        "33": "Modelo de cashflow configurable en Excel + drivers definidos.",
        "34": "Ideal para estructuras de gastos detalladas con planificación colaborativa."
      }
    },
    "q11_ia": {
      "question_justification": "Vena incorpora capacidades de IA moderadas para forecasting y análisis, con funcionalidades en desarrollo para detección de anomalías y análisis predictivo, aunque sin capacidades avanzadas de consultas en lenguaje natural.",
      "options": {
        "47": "Aunque están en roadmap, no hay capacidades avanzadas nativas de machine learning en Vena aún.",
        "48": "No se dispone de análisis automatizado de desviaciones basado en IA.",
        "49": "Permite escenarios manuales en Excel, pero no IA predictiva para escenarios.",
        "50": "No hay funcionalidad nativa de detección de anomalías.",
        "51": "Insights y alertas deben ser creados manualmente.",
        "52": "No soporta preguntas en lenguaje natural ni generación de reportes vía texto.",
        "53": "Neutral si el usuario no requiere capacidades de IA."
      }
    },
    "q5_excel": {
      "question_justification": "Vena ofrece una integración nativa con Excel, permitiendo a los usuarios seguir trabajando en este entorno familiar mientras aprovechan las capacidades avanzadas de la plataforma para consolidación, workflow y análisis.",
      "options": {
        "17": "Core absoluto de Vena. Toda la experiencia ocurre en Excel.",
        "18": "Vena depende completamente de Excel; no es una interfaz separada.",
        "19": "No aplica. Vena no está diseñado para reemplazar Excel.",
        "20": "Si Excel no es crítico, Vena puede ser útil, pero no destaca frente a soluciones independientes."
      }
    },
    "q1_size": {
      "question_justification": "Vena está orientado a empresas medianas y grandes, siendo adecuado para organizaciones de 100-1000+ empleados que buscan una solución FP&A robusta con fuerte integración con Excel.",
      "options": {
        "0": "Vena podría ser usado, pero los costes de implementación lo hacen poco eficiente para microempresas.",
        "1": "Viable para scale-ups con procesos financieros en evolución, pero requiere cierta estructura.",
        "2": "Es uno de los targets ideales de Vena. Muchas implementaciones exitosas en este rango.",
        "3": "Vena escala bien a estructuras mid-market con necesidades de consolidación y colaboración.",
        "4": "Es posible, aunque para estructuras demasiado grandes puede quedarse corto frente a soluciones enterprise como Anaplan."
      }
    },
    "q2_budget": {
      "question_justification": "Vena ofrece planes desde aproximadamente 25K USD/año, posicionándose en el segmento medio-alto del mercado FP&A, con opciones escalables según usuarios, módulos y volumen de datos.",
      "options": {
        "5": "Muy difícil encontrar una implementación de Vena por debajo de este umbral.",
        "6": "Viable para organizaciones pequeñas con pocos usuarios y funcionalidades básicas.",
        "7": "Rango habitual para implementaciones completas de Vena con varios equipos.",
        "8": "Clientes con estructuras avanzadas y múltiples integraciones encajan en este rango.",
        "9": "Menos habitual, pero puede ocurrir en empresas grandes con múltiples divisiones."
      }
    },
    "q9_modeling": {
      "question_justification": "Vena proporciona capacidades de modelado avanzadas, permitiendo estructuras multidimensionales complejas mientras mantiene la flexibilidad y familiaridad de Excel para los usuarios financieros.",
      "options": {
        "39": "Entorno muy familiar para usuarios de finanzas sin background técnico.",
        "40": "Ideal para construir modelos robustos sin complejidad técnica ni código.",
        "41": "Llega a buen nivel, aunque puede presentar límites si se requiere simulación avanzada o ML.",
        "42": "Soporta estructuras complejas, pero no está diseñado para grandes conglomerados multinacionales."
      }
    },
    "q6_integrations": {
      "question_justification": "Vena proporciona robustas integraciones con sistemas ERP, CRM, HRIS y otras fuentes de datos empresariales, con conectores predefinidos y opciones de personalización para necesidades específicas.",
      "options": {
        "21": "Vena cuenta con conectores nativos para NetSuite, Sage Intacct y otros ERPs comunes.",
        "22": "Integración con Salesforce disponible. Otros CRMs como HubSpot requieren APIs o terceros.",
        "23": "Existen integraciones con Workday y ADP. No es su foco principal.",
        "24": "Vena puede integrarse y exportar datos a Power BI y Tableau.",
        "25": "Se puede integrar vía ETL externo como Boomi o Talend.",
        "26": "Excel es núcleo de la herramienta. No tiene soporte nativo para Google Sheets.",
        "27": "Vía API o ETL partners es posible, pero requiere configuración."
      }
    }
  }
}